# docker 操作手順
## 1. dockerイメージの用意
dockerfileの作成や、公式サイトからイメージダウンロード
## 2. 用意したイメージよりコンテナを作成
`docker-compose build`によってイメージからコンテナを
構築する。
## 3. 作成したコンテナを起動
`docker-compose up;`
docker-compose.ymlで定義したサービスを開始または再起動する

 ・デフォルトは「アタッチド」モードであり、全てのコンテナのログが画面上に表示される。
 ・「デタッチド」モード（ -d ）では、Compose はコンテナを実行すると終了するが、コンテナは後ろで動き続ける 。

`docker-compose run`
「ワンオフ」（one-off；１つだけ、偶発的） または「アドホック」（adhoc；臨時）なタスクを実行 する

・実行するにはサービス名の指定が必要であり、特定のサービス用のコンテナを起動し、かつ依存関係のあるコンテナも起動する 。
・テストの実行であったり、データ・ボリューム・コンテナに対するデータの追加・削除といった管理タスク。
 ・run コマンドは実際には docker run -ti。 コンテナに対してインタラクティブなターミナルを開き、コンテナのプロセスが終了すると、その時点の該当する終了コードを返す。
`docker-compose start`
既に作成済みのコンテナを再起動 する

止まっているコンテナを起動するだけであり、新しいコンテナは作成しない。

## 4. コンテナの中に入る
`docker exec -it influxdb bash`

## 5. コンテナから出る
`docker-compose down`
docker-compose.ymlに書かれているサービスを参考にコンテナを停止し、そのコンテナとネットワークを削除します。
オプションで--rmi allをつけることでイメージも削除してくれます。

`docker-compose stop`
docker-compose.ymlに書かれているサービスを参考にコンテナを停止し、そのコンテナとネットワークを削除します。
オプションで--rmi allをつけることでイメージも削除してくれます。

`docker-compose kill`
コンテナを強制停止します。
